In [1]:
import sqlalchemy

%load_ext sql
%sql oracle://scott:tiger@localhost:1521/orcl

# 최대값 출력하기(MAX)

최대 월급을 출력하시오

In [2]:
%%sql

select max(sal) "최대 월급"
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(5000,)]

문제 112. 직업이 SALESMAN'인 사원들의 최대월급을 출력하시오!

In [3]:
%%sql

select max(sal)"최대월급"
    from emp
    where job = 'SALESMAN'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(1600,)]

문제 113. 우리반에서 최소 나이 학생의 나이를 출력하시오

In [8]:
%%sql

select min(age)
    from emp12

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(24,)]

문제 114. 통신사가 sk인 학생들 중에서 최대 나이인 학생의 나이를 출력하시오

In [11]:
%%sql

select max(age)
    from emp12
    where regexp_like(lower(telecom), '[sk]+')

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(36,)]

문제 115. 30번 부서번호의 최대 월급을 출력하시오

In [12]:
%%sql

select max(sal)
    from emp
    where regexp_like(deptno, '30')

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(2850,)]

In [13]:
%%sql

select max(sal)
    from emp
    where deptno = 30

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(2850,)]

30번의 부서번호를 가진 사람의 부서번호와 최대 월급을 출력하시오

In [14]:
%%sql

select deptno, max(sal)
    from emp
    where deptno = 30
    group by deptno

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(30, 2850)]

![image](https://user-images.githubusercontent.com/70187490/126290206-53563359-8f2c-440f-99eb-c7b57aaefb41.png)

* group by deptno를 하면 여러 개 나오려는 deptno를 grouping 해준다.

문제 116. 직업, 직업별 최대월급을 출력하는데
             직업이 'SALESMAN'만 출력하시오!

In [16]:
%%sql

select job, max(sal)
    from emp
    where regexp_like(job, 'SALES+')
    group by job

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('SALESMAN', 1600)]

문제 117. 직업이 'ANALYST'인 사원들의 최대월급을 출력하시오

In [19]:
%%sql

select max(sal), job
    from emp
    where job='ANALYST'
    group by job

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(3000, 'ANALYST')]

문제 118. 직업, 직업별 최대월급을 출력하시오

In [21]:
%%sql

select job, max(sal)
    from emp
    where job is not null
    group by job

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('SALESMAN', 1600),
 ('CLERK', 1300),
 ('ANALYST', 3000),
 ('MANAGER', 2975),
 ('PRESIDENT', 5000)]


문제 119. 위의 결과를 다시 출력하는데 직업별 최대월급이 높은 것 부터 출력하시오.

In [28]:
%%sql

select job, max(sal)
    from emp
    where job is not null
    group by job
    order by max(sal) desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('PRESIDENT', 5000),
 ('ANALYST', 3000),
 ('MANAGER', 2975),
 ('SALESMAN', 1600),
 ('CLERK', 1300)]

문제 120. 부서번호, 부서번호별 최대월급을 출력하는데
             부서번호별 최대월급이 높은 것 부터 출력하시오

In [31]:
%%sql

select deptno, max(sal)
    from emp
    where job is not null
    group by deptno
    order by max(sal) desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(10, 5000), (20, 3000), (30, 2850)]

In [35]:
%%sql

select deptno, max(sal)
    from emp
    group by deptno
    order by max(sal) desc nulls last

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[(10, 5000), (20, 3000), (30, 2850), (None, None)]

★ to_char를 이용해서 숫자를 문자로 형변환하기  
select sal, to_char(sal, '999,999') ---> 은행권에서는 무조건 해줘야 함  

<br>

- to_char(sal, '999,999')의 의미는 sal 숫자를 문자로 출력하는데  
    - to_char(숫자형 컬럼, '문자포맷')의 문법에 따라 문자 포맷에 맞는 문자로 출력하는 것
    - 9는 자릿수를 의미하고 이 자리에 0~9 사이의 숫자중에 어떤 숫자든 관계는 없지만 자릿수는 한자리여야 한다는 의미
    - 자릿수 형식이 있어야 하는 숫자를 출력해야 할 때 쓰임
   
    
문제 121. 이름과 연봉(월급 x 12)를 출력하는데 연봉을 출력할 때 천 단위와 백만 단위가 표시되게 하시오

In [38]:
%%sql

select ename as "이름", to_char(sal *12, '9,999,999') as "최대 월급"
    from emp
    where sal is not null

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', '    60,000'),
 ('BLAKE', '    34,200'),
 ('CLARK', '    29,400'),
 ('JONES', '    35,700'),
 ('MARTIN', '    15,000'),
 ('ALLEN', '    19,200'),
 ('TURNER', '    18,000'),
 ('JAMES', '    11,400'),
 ('WARD', '    15,000'),
 ('FORD', '    36,000'),
 ('SMITH', '     9,600'),
 ('SCOTT', '    36,000'),
 ('ADAMS', '    13,200'),
 ('MILLER', '    15,600')]


문제 123. 직업과 직업별 최대월급을 출력하는데 
             직업별 최대월급을 출력할때 천단위 콤마가 출력되게 하시오

In [43]:
%%sql

select job as "직업", to_char(max(sal), '9,999') as "최대 월급"
    from emp
    where job is not null
    group by job
    order by max(sal) desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('PRESIDENT', ' 5,000'),
 ('ANALYST', ' 3,000'),
 ('MANAGER', ' 2,975'),
 ('SALESMAN', ' 1,600'),
 ('CLERK', ' 1,300')]